NordicPlayground/nRF51-ble-bcast-mesh/nRF51/rbc_mesh/src/mesh_srv.c
/***********************************************************************************
Copyright (c) Nordic Semiconductor ASA
All rights reserved.

Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

  1. Redistributions of source code must retain the above copyright notice, this
  list of conditions and the following disclaimer.

  2. Redistributions in binary form must reproduce the above copyright notice, this
  list of conditions and the following disclaimer in the documentation and/or
  other materials provided with the distribution.

  3. Neither the name of Nordic Semiconductor ASA nor the names of other
  contributors to this software may be used to endorse or promote products
  derived from this software without specific prior written permission.

  4. This software must only be used in a processor manufactured by Nordic
  Semiconductor ASA, or in a processor manufactured by a third party that
  is used in combination with a processor manufactured by Nordic Semiconductor.


THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
************************************************************************************/

#include "mesh_srv.h"
#include "rbc_mesh.h"
#include "timeslot_handler.h"
#include "trickle.h"
#include "rbc_mesh_common.h"
#include "mesh_aci.h"

#include "nrf_soc.h"
#include "nrf_error.h"
#include "ble.h"

#include <stdlib.h>
#include <stdbool.h>
#include <string.h>

/* Packet related constants */
#define MESH_PACKET_HANDLE_LEN          (1)
#define MESH_PACKET_VERSION_LEN         (2)

#define MESH_PACKET_HANDLE_OFFSET       (0)
#define MESH_PACKET_VERSION_OFFSET      (MESH_PACKET_HANDLE_OFFSET + MESH_PACKET_HANDLE_LEN)
#define MESH_PACKET_DATA_OFFSET         (MESH_PACKET_VERSION_OFFSET + MESH_PACKET_VERSION_LEN)

#define CONN_HANDLE_INVALID             (0xFFFF)
/*****************************************************************************
* Local Type Definitions
*****************************************************************************/

typedef struct
{
    uint8_t value_count;
    mesh_char_metadata_t* char_metadata;
    uint16_t service_handle;
    ble_gatts_char_handles_t ble_md_char_handles;
} mesh_srv_t;



/*****************************************************************************
* Static globals
*****************************************************************************/
static mesh_srv_t g_mesh_service = {0, NULL, 0};

static const ble_uuid128_t mesh_base_uuid = {0x1E, 0xCD, 0x00, 0x00, 
                                            0x8C, 0xB9, 0xA8, 0x8B,
                                            0x82, 0xD8, 0x51, 0xFD,
                                            0xA1, 0x77, 0x1E, 0x2A};
static uint8_t mesh_base_uuid_type;

static bool is_initialized = false;
                                            
static uint16_t g_active_conn_handle = CONN_HANDLE_INVALID;

/*****************************************************************************
* Static functions
*****************************************************************************/

/**
* @brief Add metadata GATT characteristic to the Mesh GATT service. Part of 
*   the initialization procedure.
*/                                            
static uint32_t mesh_md_char_add(mesh_metadata_char_t* metadata)
{    
    /**@TODO: put ranges in public #defines */
    if (metadata->mesh_channel > 39 || 
        metadata->mesh_adv_int_ms < 5 || 
        metadata->mesh_adv_int_ms > 60000)
    {
        return NRF_ERROR_INVALID_PARAM;
    }
    
    /* cccd for metadata char */
    ble_gatts_attr_md_t cccd_md;
    
    memset(&cccd_md, 0, sizeof(cccd_md));
    
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.write_perm);
    cccd_md.vloc = BLE_GATTS_VLOC_STACK;
    
    /* metadata char */
    ble_gatts_char_md_t ble_char_md;
        
    memset(&ble_char_md, 0, sizeof(ble_char_md));
    
    ble_char_md.char_props.read = 1;
    ble_char_md.char_props.notify = 1;
    
    ble_char_md.p_char_pf = NULL;
    ble_char_md.p_cccd_md = &cccd_md;
    ble_char_md.p_char_user_desc = NULL;
    ble_char_md.p_user_desc_md = NULL;
    
    /* ATT metadata */
    ble_gatts_attr_md_t ble_attr_md;
    
    memset(&ble_attr_md, 0, sizeof(ble_attr_md));
    
    ble_attr_md.read_perm.lv = 1;
    ble_attr_md.read_perm.sm = 1;
    ble_attr_md.write_perm.lv = 1;
    ble_attr_md.write_perm.sm = 1;
    
    ble_attr_md.rd_auth = 0;
    ble_attr_md.wr_auth = 0;
    ble_attr_md.vlen = 0;
    ble_attr_md.vloc = BLE_GATTS_VLOC_STACK;
    
    /* ble characteristic UUID */
    ble_uuid_t ble_uuid;
    
    ble_uuid.type = mesh_base_uuid_type;
    ble_uuid.uuid = MESH_MD_CHAR_UUID;
    
    /* metadata contents */
    uint8_t value_array[MESH_MD_CHAR_LEN];
    
    memcpy(&value_array[MESH_MD_CHAR_AA_OFFSET], 
        &metadata->mesh_access_addr, 
        sizeof(metadata->mesh_access_addr));
    
    memcpy(&value_array[MESH_MD_CHAR_ADV_INT_OFFSET], 
        &metadata->mesh_adv_int_ms, 
        sizeof(metadata->mesh_adv_int_ms));
        
    memcpy(&value_array[MESH_MD_CHAR_COUNT_OFFSET], 
        &metadata->mesh_value_count, 
        sizeof(metadata->mesh_value_count));
    
    memcpy(&value_array[MESH_MD_CHAR_CH_OFFSET], 
        &metadata->mesh_channel, 
        sizeof(metadata->mesh_channel));
    
    
