NordicPlayground/nRF51-ble-bcast-mesh/nRF51/rbc_mesh/src/mesh_srv.c
    /* ble attribute */
    ble_gatts_attr_t ble_attr;
    
    memset(&ble_attr, 0, sizeof(ble_attr));
    
    ble_attr.init_len = 9;
    ble_attr.init_offs = 0;
    ble_attr.max_len = 9;
    ble_attr.p_uuid = &ble_uuid;
    ble_attr.p_value = value_array;
    ble_attr.p_attr_md = &ble_attr_md;
    
    /* add characteristic */    
    uint32_t error_code = sd_ble_gatts_characteristic_add(
        g_mesh_service.service_handle,
        &ble_char_md,
        &ble_attr, 
        &g_mesh_service.ble_md_char_handles);
        
    if (error_code != NRF_SUCCESS)
    {
        return NRF_ERROR_INTERNAL;
    }
    
    
    
    return NRF_SUCCESS;
}

/**
* @brief Add a mesh value GATT characterisitic to the mesh GATT service.
*   Part of the initialization procedure.
*/
static uint32_t mesh_value_char_add(uint8_t index)
{
    if (index >= MAX_VALUE_COUNT)
    {
        return NRF_ERROR_INVALID_PARAM;
    }
    
    /* metadata presentation format */
    ble_gatts_char_pf_t ble_char_pf;
    
    memset(&ble_char_pf, 0, sizeof(ble_char_pf));
    
    ble_char_pf.name_space = BLE_GATT_CPF_NAMESPACE_BTSIG;
    ble_char_pf.exponent = 0;
    ble_char_pf.format = BLE_GATT_CPF_FORMAT_UINT8;
    ble_char_pf.desc = index + 1; /* trickle instance id/handle */
    
    
    /* BLE GATT metadata */
    ble_gatts_char_md_t ble_char_md;
    
    memset(&ble_char_md, 0, sizeof(ble_char_md));
    
    ble_char_md.p_char_pf = &ble_char_pf;
    ble_char_md.char_props.read = 1;
    ble_char_md.char_props.write_wo_resp = 1;
    ble_char_md.char_props.notify = 1;
    
    ble_char_md.p_cccd_md = NULL;
    ble_char_md.p_sccd_md = NULL;
    ble_char_md.p_char_user_desc = NULL;
    ble_char_md.p_user_desc_md = NULL;
    
    /* ATT metadata */
    
    ble_gatts_attr_md_t ble_attr_md;
    
    memset(&ble_attr_md, 0, sizeof(ble_attr_md));
    
    /* No security is required whatsoever, needs to be changed when encryption
        is added */
    ble_attr_md.read_perm.lv = 1;
    ble_attr_md.read_perm.sm = 1;
    ble_attr_md.write_perm.lv = 1;
    ble_attr_md.write_perm.sm = 1;
    
    ble_attr_md.vloc = BLE_GATTS_VLOC_STACK;
    ble_attr_md.rd_auth = 0;
    ble_attr_md.wr_auth = 0;
    ble_attr_md.vlen = 1;
    
    /* ble characteristic UUID */
    ble_uuid_t ble_uuid;
    
    ble_uuid.type = mesh_base_uuid_type;
    ble_uuid.uuid = MESH_VALUE_CHAR_UUID;
    
    /* ble attribute */
    ble_gatts_attr_t ble_attr;
    uint8_t default_value = 0;
    
    memset(&ble_attr, 0, sizeof(ble_attr));
    
    ble_attr.init_len = 1;
    ble_attr.init_offs = 0;
    ble_attr.max_len = MAX_VALUE_LENGTH;
    ble_attr.p_attr_md = &ble_attr_md;
    ble_attr.p_uuid = &ble_uuid;
    ble_attr.p_value = &default_value;
    
    
    /* add to service */
    ble_gatts_char_handles_t ble_value_char_handles;
    
    uint32_t error_code = sd_ble_gatts_characteristic_add(
        g_mesh_service.service_handle, 
        &ble_char_md, 
        &ble_attr, 
        &ble_value_char_handles);
        
    if (error_code != NRF_SUCCESS)
    {
        return NRF_ERROR_INTERNAL;
    }
    
    g_mesh_service.char_metadata[index].char_value_handle =  ble_value_char_handles.value_handle;
    
    return NRF_SUCCESS;
}

/*****************************************************************************
* Interface functions
*****************************************************************************/

uint32_t mesh_srv_init(uint8_t mesh_value_count, 
    uint32_t access_address, uint8_t channel, uint32_t adv_int_ms)
{
    if (mesh_value_count > MAX_VALUE_COUNT)
    {
        return NRF_ERROR_INVALID_PARAM;
    }
    
    if (is_initialized)
    {
        return NRF_ERROR_INVALID_STATE;
    }
    
    is_initialized = true;
    
    ble_enable_params_t ble_enable_params;
    ble_enable_params.gatts_enable_params.service_changed = 0;
    
    sd_ble_enable(&ble_enable_params);
    
    g_mesh_service.value_count = mesh_value_count;
    
    ble_uuid_t ble_srv_uuid;
    
    /* add the mesh base UUID */
    
    uint32_t error_code = sd_ble_uuid_vs_add(&mesh_base_uuid, &mesh_base_uuid_type);
    if (error_code != NRF_SUCCESS)
    {
        return NRF_ERROR_INTERNAL;
    }
    
    ble_srv_uuid.type = mesh_base_uuid_type;
    ble_srv_uuid.uuid = MESH_SRV_UUID;
    
    error_code = sd_ble_gatts_service_add(BLE_GATTS_SRVC_TYPE_PRIMARY, 
        &ble_srv_uuid, &g_mesh_service.service_handle);
    
    if (error_code != NRF_SUCCESS)
    {
        return NRF_ERROR_INTERNAL;
    }
    
    /* Add metadata characteristic */
    mesh_metadata_char_t mesh_metadata;
    mesh_metadata.mesh_access_addr = access_address;
    mesh_metadata.mesh_adv_int_ms = adv_int_ms;
    mesh_metadata.mesh_channel = channel;
    mesh_metadata.mesh_value_count = mesh_value_count;
    
    mesh_md_char_add(&mesh_metadata);
    
    uint32_t md_len = sizeof(mesh_char_metadata_t) * g_mesh_service.value_count;
    
    /* allocate metadata array */
    g_mesh_service.char_metadata = (mesh_char_metadata_t*) malloc(md_len);    
    memset(g_mesh_service.char_metadata, 0, md_len);
    
    /* add characteristics to mesh service */
    for (uint8_t i = 0; i < g_mesh_service.value_count; ++i)
    {
        error_code = mesh_value_char_add(i);
        
        if (error_code != NRF_SUCCESS)
        {
            return error_code;
        }   
    }
    
    trickle_setup(1000 * adv_int_ms, 600, 3);
    
    return NRF_SUCCESS;
}


uint32_t mesh_srv_char_val_set(uint8_t index, uint8_t* data, uint16_t len, bool update_sender)
{
    if (!is_initialized)
    {
        return NRF_ERROR_INVALID_STATE;
    }
    
    if (index > g_mesh_service.value_count || index == 0)
    {
        return NRF_ERROR_INVALID_ADDR;
    }
    
    if (len > MAX_VALUE_LENGTH)
    {
        return NRF_ERROR_INVALID_LENGTH;
    }
    uint32_t error_code = 0;
    
    mesh_char_metadata_t* ch_md = &g_mesh_service.char_metadata[index - 1];
    
    /* this is now a new version of this data, signal to the rest of the mesh */
    ++ch_md->version_number;
    
    bool first_time = 
        (ch_md->flags & 
        (1 << MESH_MD_FLAGS_USED_POS)) == 0;
    
    if (first_time)
    {
        ch_md->flags |= 
            (1 << MESH_MD_FLAGS_INITIALIZED_POS) |
            (1 << MESH_MD_FLAGS_USED_POS);
        trickle_init(&ch_md->trickle);
    }
    else
    {
        trickle_rx_inconsistent(&ch_md->trickle);
    }
    
