NordicPlayground/nRF51-ble-bcast-mesh/nRF51/rbc_mesh/src/mesh_srv.c
    if (update_sender || first_time)
    {
        ble_gap_addr_t my_addr;
        sd_ble_gap_address_get(&my_addr);
        memcpy(&ch_md->last_sender_addr, &my_addr, sizeof(ble_gap_addr_t));
        ch_md->flags |= (1 << MESH_MD_FLAGS_IS_ORIGIN_POS);
    }
        
    /* notify the connected central node, if any */
    if (g_active_conn_handle != CONN_HANDLE_INVALID)
    {
        ble_gatts_hvx_params_t notify_params;
        notify_params.handle = ch_md->char_value_handle;
        notify_params.offset = 0;
        notify_params.p_data = data;
        notify_params.p_len = &len;
        notify_params.type = BLE_GATT_HVX_NOTIFICATION;
        error_code = sd_ble_gatts_hvx(g_active_conn_handle, &notify_params);
        if (error_code != NRF_SUCCESS)
        {
            if (error_code == BLE_ERROR_INVALID_CONN_HANDLE)
            {
                g_active_conn_handle = CONN_HANDLE_INVALID;
            }
            else if (error_code == BLE_GATTS_EVT_SYS_ATTR_MISSING)
            {
                sd_ble_gatts_sys_attr_set(g_active_conn_handle, NULL, 0);
            }
            else
            {
                return NRF_ERROR_INTERNAL;
            }
        }
    }
    else
    {
        error_code = sd_ble_gatts_value_set(
            ch_md->char_value_handle, 
            0, &len, data);
        
        if (error_code != NRF_SUCCESS)
        {
            return NRF_ERROR_INTERNAL;
        }
    }
    
    return NRF_SUCCESS;
}

uint32_t mesh_srv_char_val_get(uint8_t index, uint8_t* data, uint16_t* len, ble_gap_addr_t* origin_addr)
{
    if (!is_initialized)
    {
        return NRF_ERROR_INVALID_STATE;
    }
    
    if (index > g_mesh_service.value_count || index == 0)
    {
        return NRF_ERROR_INVALID_ADDR;
    }
    
    *len = MAX_VALUE_LENGTH;
    
    uint32_t error_code = sd_ble_gatts_value_get(
        g_mesh_service.char_metadata[index - 1].char_value_handle, 
        0, len, data);
    
    if (error_code != NRF_SUCCESS)
    {
        return NRF_ERROR_INTERNAL;
    }
    
    if (origin_addr != NULL)
    {
        memcpy(origin_addr, 
            &g_mesh_service.char_metadata[index - 1].last_sender_addr, 
            sizeof(ble_gap_addr_t));
    }
    
    return NRF_SUCCESS;
}

uint32_t mesh_srv_char_md_get(mesh_metadata_char_t* metadata)
{
    if (!is_initialized)
    {
        return NRF_ERROR_INVALID_STATE;
    }
    
    uint8_t data_array[MESH_MD_CHAR_LEN];
    uint16_t len = MESH_MD_CHAR_LEN;
    
    uint32_t error_code = sd_ble_gatts_value_get(
        g_mesh_service.ble_md_char_handles.value_handle, 0, &len, data_array);
    
    if (error_code != NRF_SUCCESS)
    {
        return NRF_ERROR_INTERNAL;
    }
    
    if (len != MESH_MD_CHAR_LEN)
    {
        return NRF_ERROR_INTERNAL;
    }
    
    memcpy(&metadata->mesh_access_addr, 
        &data_array[MESH_MD_CHAR_AA_OFFSET],
        sizeof(metadata->mesh_access_addr));
    
    memcpy(&metadata->mesh_adv_int_ms, 
        &data_array[MESH_MD_CHAR_ADV_INT_OFFSET],
        sizeof(metadata->mesh_adv_int_ms));
    
    memcpy(&metadata->mesh_channel, 
        &data_array[MESH_MD_CHAR_CH_OFFSET],
        sizeof(metadata->mesh_channel));
    
    memcpy(&metadata->mesh_value_count, 
        &data_array[MESH_MD_CHAR_COUNT_OFFSET],
        sizeof(metadata->mesh_value_count));
    
    return NRF_SUCCESS;
}

uint32_t mesh_srv_get_next_processing_time(uint32_t* time)
{
    if (!is_initialized)
    {
        return NRF_ERROR_INVALID_STATE;
    }
    bool anything_to_process = false;
    *time = UINT32_MAX;
    
    for (uint8_t i = 0; i < g_mesh_service.value_count; ++i)
    {
        if ((g_mesh_service.char_metadata[i].flags & (1 << MESH_MD_FLAGS_USED_POS)) == 0)
            continue;
            
        uint32_t temp_time = trickle_next_processing_get(&g_mesh_service.char_metadata[i].trickle);
        
        if (temp_time < *time)
        {
            anything_to_process = true;
            *time = temp_time;
        }
    }
    if (!anything_to_process)
    {
        return NRF_ERROR_NOT_FOUND;
    }
        
    return NRF_SUCCESS;
}

uint32_t mesh_srv_packet_process(packet_t* packet)
{
    if (!is_initialized)
    {
        return NRF_ERROR_INVALID_STATE;
    }
    uint32_t error_code;
    
    uint8_t handle = packet->data[MESH_PACKET_HANDLE_OFFSET];
    uint16_t version = (packet->data[MESH_PACKET_VERSION_OFFSET] | 
                    (((uint16_t) packet->data[MESH_PACKET_VERSION_OFFSET + 1]) << 8));
    uint8_t* data = &packet->data[MESH_PACKET_DATA_OFFSET];
    uint16_t data_len = packet->length - MESH_PACKET_DATA_OFFSET;
    
    if (data_len > MAX_VALUE_LENGTH)
    {
        return NRF_ERROR_INVALID_LENGTH;
    }
    
    if (handle > g_mesh_service.value_count || handle == 0)
    {
        return NRF_ERROR_INVALID_ADDR;
    }
    
    
    mesh_char_metadata_t* ch_md = &g_mesh_service.char_metadata[handle - 1];
    
    bool uninitialized = !(ch_md->flags & (1 << MESH_MD_FLAGS_INITIALIZED_POS));
    
    if (uninitialized)
    {
        trickle_init(&ch_md->trickle);
    }
    
    if (ch_md->version_number != version)
    {
        trickle_rx_inconsistent(&ch_md->trickle);
    }
    
    /* new version */
    /**@TODO: Handle version overflow */
    if (version > ch_md->version_number || uninitialized)
    {
        /* update value */
        mesh_srv_char_val_set(handle, data, data_len, false);
        ch_md->flags |= (1 << MESH_MD_FLAGS_INITIALIZED_POS);
        ch_md->flags &= ~(1 << MESH_MD_FLAGS_IS_ORIGIN_POS);
        ch_md->version_number = version;
        
        /* Manually set originator address */
        memcpy(&ch_md->last_sender_addr, &packet->sender, sizeof(ble_gap_addr_t));
        
        rbc_mesh_event_t update_evt;
        update_evt.event_type = ((uninitialized)? 
            RBC_MESH_EVENT_TYPE_NEW_VAL :
            RBC_MESH_EVENT_TYPE_UPDATE_VAL);
        update_evt.data_len = data_len;
        update_evt.value_handle = handle;
        
        update_evt.data = data;
        memcpy(&update_evt.originator_address, &packet->sender, sizeof(ble_gap_addr_t));
        
        rbc_mesh_event_handler(&update_evt);
#ifdef RBC_MESH_SERIAL
            mesh_aci_rbc_event_handler(&update_evt);
#endif
    }
    else if (version == ch_md->version_number)
    {
        /* check for conflicting data */
        uint16_t old_len = MAX_VALUE_LENGTH;
        
        error_code = mesh_srv_char_val_get(handle, NULL, &old_len, NULL);
        if (error_code != NRF_SUCCESS)
        {
            return error_code;
        }
        
        volatile bool conflicting = false;
        
