NordicPlayground/nRF51-ble-bcast-mesh/nRF51/rbc_mesh/src/mesh_srv.c
        if (packet->rx_crc != ch_md->crc && 
            !(ch_md->flags & (1 << MESH_MD_FLAGS_IS_ORIGIN_POS)))
        {
            conflicting = true;
        }
        else if (old_len != data_len)
        {
            conflicting = true;
        }
        
        
        if (conflicting)
        {
            TICK_PIN(7);
            rbc_mesh_event_t conflicting_evt;
            
            conflicting_evt.event_type = RBC_MESH_EVENT_TYPE_CONFLICTING_VAL;
            
            conflicting_evt.data_len = data_len;
            conflicting_evt.value_handle = handle;
            
            conflicting_evt.data = data;
            memcpy(&conflicting_evt.originator_address, &packet->sender, sizeof(ble_gap_addr_t));
            
            trickle_rx_inconsistent(&ch_md->trickle);
            
            rbc_mesh_event_handler(&conflicting_evt);
#ifdef RBC_MESH_SERIAL
            mesh_aci_rbc_event_handler(&conflicting_evt);
#endif
        }
        else
        { 
            trickle_rx_consistent(&ch_md->trickle);
        }
        
    }
    
    
    ch_md->crc = packet->rx_crc;
    
    return NRF_SUCCESS;
}

uint32_t mesh_srv_conn_handle_update(uint16_t conn_handle)
{
    g_active_conn_handle = conn_handle;
    
    return NRF_SUCCESS;
}

uint32_t mesh_srv_packet_assemble(packet_t* packet, 
    uint16_t packet_max_len, 
    bool* has_anything_to_send)
{
    *has_anything_to_send = false;
    if (!is_initialized)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    uint32_t error_code;
    
    for (uint8_t i = 0; i < g_mesh_service.value_count; ++i)
    {
        mesh_char_metadata_t* md_ch = &g_mesh_service.char_metadata[i];
        
        if ((md_ch->flags & (1 << MESH_MD_FLAGS_USED_POS)) == 0)
            continue;
        
        bool do_trickle_tx = false;
        trickle_step(&md_ch->trickle, &do_trickle_tx);
        

        if (do_trickle_tx && !(*has_anything_to_send))
        {
            trickle_register_tx(&md_ch->trickle);
            uint8_t data[MAX_VALUE_LENGTH];
            uint16_t len = MAX_VALUE_LENGTH;

            error_code = mesh_srv_char_val_get(i + 1, data, &len, NULL);

            if (error_code != NRF_SUCCESS)
            {
                return error_code;
            }

            packet->data[MESH_PACKET_HANDLE_OFFSET] = i + 1;
            packet->data[MESH_PACKET_VERSION_OFFSET] = 
                (md_ch->version_number & 0xFF); 
            packet->data[MESH_PACKET_VERSION_OFFSET + 1] = 
                ((md_ch->version_number >> 8) & 0xFF);
            
            memcpy(&packet->data[MESH_PACKET_DATA_OFFSET], data, len);
            packet->length = len + MESH_PACKET_DATA_OFFSET;
            
            memcpy(&packet->sender, &md_ch->last_sender_addr, sizeof(md_ch->last_sender_addr));
           
            /**@TODO: Add multiple trickle messages in one packet */

            *has_anything_to_send = true;
            //break;
        }
    }
    
    return NRF_SUCCESS;
}


uint32_t mesh_srv_gatts_evt_write_handle(ble_gatts_evt_write_t* evt)
{
    if (!is_initialized)
    {
        return NRF_ERROR_INVALID_STATE;
    }
    
    if (evt->context.srvc_handle != g_mesh_service.service_handle)
    {
        return NRF_ERROR_FORBIDDEN;
    }
    
    for (uint8_t i = 0; i < g_mesh_service.value_count; ++i)
    {
        if (g_mesh_service.char_metadata[i].char_value_handle == evt->handle)
        {
            mesh_char_metadata_t* ch_md = &g_mesh_service.char_metadata[i];
            bool uninitialized = !(ch_md->flags & (1 << MESH_MD_FLAGS_INITIALIZED_POS));
    
            if (uninitialized)
            {
                trickle_init(&ch_md->trickle);
            }
    
            ch_md->flags |= 
                (1 << MESH_MD_FLAGS_INITIALIZED_POS) |
                (1 << MESH_MD_FLAGS_USED_POS) |
                (1 << MESH_MD_FLAGS_IS_ORIGIN_POS);
            
            ++ch_md->version_number;
            trickle_rx_inconsistent(&ch_md->trickle);
            ble_gap_addr_t my_addr;
            sd_ble_gap_address_get(&my_addr);
            memcpy(&ch_md->last_sender_addr, &my_addr, sizeof(ble_gap_addr_t));
            
            rbc_mesh_event_t update_evt;
            update_evt.event_type = ((uninitialized)? 
                RBC_MESH_EVENT_TYPE_NEW_VAL :
                RBC_MESH_EVENT_TYPE_UPDATE_VAL);
           
            update_evt.data_len = evt->len;
            update_evt.value_handle = i + 1;
            update_evt.data = evt->data;
            memcpy(&update_evt.originator_address, &my_addr, sizeof(ble_gap_addr_t));
            
            rbc_mesh_event_handler(&update_evt);
#ifdef RBC_MESH_SERIAL
            mesh_aci_rbc_event_handler(&update_evt);
#endif
            
            return NRF_SUCCESS;
        }
    }
    return NRF_ERROR_INVALID_ADDR;
}

uint32_t mesh_srv_char_val_enable(uint8_t index)
{
    if (!is_initialized)
    {
        return NRF_ERROR_INVALID_STATE;
    }
    
    if (index > g_mesh_service.value_count || index == 0)
    {
        return NRF_ERROR_INVALID_ADDR;
    }
    
    trickle_init(&g_mesh_service.char_metadata[index - 1].trickle);
    
    g_mesh_service.char_metadata[index - 1].flags |= 
        (1 << MESH_MD_FLAGS_INITIALIZED_POS) |
        (1 << MESH_MD_FLAGS_USED_POS);
    
    
    return NRF_SUCCESS;
}

uint32_t mesh_srv_char_val_disable(uint8_t index)
{
    if (!is_initialized)
    {
        return NRF_ERROR_INVALID_STATE;
    }
    
    if (index > g_mesh_service.value_count || index == 0)
    {
        return NRF_ERROR_INVALID_ADDR;
    }
    
    g_mesh_service.char_metadata[index - 1].flags &=
        ~(1 << MESH_MD_FLAGS_USED_POS);
    
    return NRF_SUCCESS;
}
